```
Вычислите коэффициенты линейной регрессии с l2-регуляризацией, используя аналитическую формулу Тихонова, если:
x1 = (5, 9, 4, 3, 5),
x2 = (15, 18, 18, 19, 19),
x3=(7, 6, 7, 7, 7),
y = (24, 22, 35, 33, 36)
```

import numpy as np

# Данные
x1 = np.array([5, 9, 4, 3, 5])
x2 = np.array([15, 18, 18, 19, 19])
x3 = np.array([7, 6, 7, 7, 7])
y = np.array([24, 22, 35, 33, 36])

# Параметр регуляризации
alpha = 1

# Формирование матрицы признаков X с добавлением столбца из единиц
X = np.vstack([np.ones_like(x1), x1, x2, x3]).T

# Вычисление коэффициентов
XTX = X.T @ X
XTy = X.T @ y
XTX_reg = XTX + alpha * np.eye(XTX.shape[0])
w = np.linalg.inv(XTX_reg) @ XTy

print(w)


