'''
Напишите lambda-функцию area(a,b), которая принимает на вход два числа — стороны прямоугольника — через запятую и возвращает площадь прямоугольника.

Пример:

print(area(12,5))
# 60
'''

area = lambda a, b: a * b
print(area(12,5))
