'''
Выведите таблицу квадратов и кубов для чисел от 1 до 10 включительно. Каждая новая строка выводится через print() и имеет формат '2 4 8' (число => его квадрат => его куб).
'''
# Введите свое решение ниже
[print(n, n**2, n**3) for n in range(1, 11)]
